--[[
authored"by"LITAO
]]

PrefixName={
	"欧阳","公孙","诸葛","司徒","上官","东郭","南门","呼延","司空","端木","夏侯","司马","东方","尉迟","皇甫","赫连","公冶","单于","申屠","轩辕","令狐","宇文","长孙","慕容","独孤","南宫","西门","东门","拓跋",
	"赵","孙","钱","李","王","马","凌","邵","匡","沈","韦","包","鲍","徐","蔡","叶","胡","许","关","周","吴","郑","冯","何","吕","孔","曹","马","苗",
	"花","方","史","俞","贺","任","倪","汤","罗","毕","邬","常","乐","于","时","傅","皮","卞","齐","康","伍","元","顾","卜","孟","平","黄","和","穆",
	"萧","尹","姚","汪","湛","祁","毛","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","祝","屈",
}
MidName={"","","","",""}

SuffixName={
	"淑婉","子萱","彩萱","贞婉","晓慧","天","白晴","婉清","菩梅","凝云","秀越","冰珍","嘉丽","怜阳","晓绿","紫翠","绿春","凝","小瑜","萦思","晓兰","小谷","谷丝","倩","冰枫","秀媛","冬萱","昭懿","清馨","思洁",
	"隽洁","白容","念珍","佳妍","慧秀","清秋","奥","夏青","闲静","春儿","凌萱","醉香","霞文","蓓蕾","清韵","端静","雅容","梦旋","秋月","冰真","秀筠","一禾","铃语","依凝","雅秀","青亦","芮美","芷珍","依波","暮雨",
	"乐章","星纬","鹏鲲","阳秋","修德","语堂","鸿祯","凯歌","英豪","泰和","德惠","晗日","雨泽","和志","高逸","巍昂","玉书","兴修","鸿","英卓","朋义","经武","奇邃","正奇","飞鸿","鸿飞","建义","泰华","弘光","高昂",
	"巍昂","欣德","博超","阳舒","力强","坚壁","高昂","伟诚","良骥","君浩","茂彦","永贞","建业","博延","项禹","咏志","英达","高原","庆生","博容","和玉","才良","学义","良畴","立群","坚壁","信鸿","德厚","阳嘉",
	"高超","睿范","建白","涵衍","兴修","乐容","子实","俊捷","安翔","天瑞","朋义","成济","文柏","翰海","嘉纳","升荣","泰初","斯年","成益","语堂","和韵","博裕","志诚","兴庆","弘厚","兴贤","瀚漠","锐立","文栋","欣嘉",
	"兴平","欣悦","烨烁","安歌","英睿","宏扬","景同","鸿祯","鸿才","俊楠","光亮","璞瑜","天禄","敏才","子濯","博艺","承基","成济","高雅","嘉木","兴旺","景铄","睿思","向阳","良才","光耀","英华","志明","巍然","伟泽",
	"乐心","修德","英才","文林","理群","鹏运","展鹏","荣轩","天路","良畴","乐安","鹏翼","嘉泽","鸿","立","俊","烨烁","弘致","宏伯","俊喆","飞扬","奇水","烨烁","承福","天佑","晗日","宏扬","高丽","宏达","宇航",
	"浩歌","彬郁","高丽","高韵","安民","浩宇","俊楚","文林","子石","元忠","博文","建中","英卓","茂实","正祥","博赡","才艺","飞宇","学真","阳羽","咏思","立人","嘉熙","信然","晗日","英纵","飞章","文栋","涵衍","正真",
}
